public/pages/manual.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>emacs-noty Manual</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="description" content="">
  <meta name="keywords" content="">
  <link rel="stylesheet" href="/assets/css/main.css">
  <link rel="stylesheet" href="/assets/css/modus-operandi.css" id="noty-theme">
</head>
<body>
  <header class="noty-header">
    <nav class="noty-nav">
  <a href="/index.html" class="noty-nav-brand">Home</a>
  <ul class="noty-nav-list">
    <li><a href="/areas/index.html">Areas</a></li>
    <li><a href="/projects/index.html">Projects</a></li>
    <li><a href="/personal/index.html">Personal</a></li>
    <li><a href="/pages/manual.html">Manual</a></li>
  </ul>
  <div class="noty-nav-actions">
    <button class="theme-toggle" type="button" title="Toggle theme">🌓</button>
    <button class="sidenote-toggle" type="button" title="Toggle notes">☰</button>
  </div>
</nav>

  </header>
  <main class="page">
    <aside class="left-bar">
      <div id="toc"></div>
    </aside>
    <article class="content noty-article">
      <h1 class="noty-title">emacs-noty Manual</h1>
      <div id="outline-container-org202d948" class="outline-2">
<h2 id="org202d948"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
emacs-noty is a template-based publishing system for Org-mode
wikis.  It separates your <b>content</b> (Org files) from <b>presentation</b>
(HTML templates, CSS themes) and <b>output</b> (a static site under
<code>public/</code>).
</p>

<p>
The system is designed for mathematical notes but works for any
kind of personal wiki.
</p>
</div>
</div>
<div id="outline-container-org798a79c" class="outline-2">
<h2 id="org798a79c"><span class="section-number-2">2.</span> Concepts</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>noty-source-root</code>: the root directory of your notes (sections
like <code>areas/</code>, <code>projects/</code>, <code>personal/</code>, and the <code>assets/</code> folder).</li>
<li><code>noty-publish-root</code>: the directory where the generated static
site is written, usually <code>public/</code> under <code>noty-source-root</code>.</li>
<li><code>noty-templates-dir</code>: directory with HTML templates and partials,
usually <code>assets/templates/</code> under <code>noty-source-root</code>.</li>
<li>Sections: top-level subdirectories under <code>noty-source-root</code> such
as <code>areas/</code>, <code>projects/</code>, <code>personal/</code>, and any you add later
(e.g. <code>house/</code>).</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb41ef8" class="outline-2">
<h2 id="orgcb41ef8"><span class="section-number-2">3.</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Place the <code>lisp/</code> directory somewhere on your Emacs load path.</li>
<li>Add the following to your init file:</li>

<li>Restart Emacs or evaluate the forms.</li>
</ol>
</div>
</div>
<div id="outline-container-orgffae6b4" class="outline-2">
<h2 id="orgffae6b4"><span class="section-number-2">4.</span> Setting up a new wiki</h2>
<div class="outline-text-2" id="text-4">
<p>
Run:
</p>

<p>
Choose an empty directory.  emacs-noty will copy a skeleton
structure into it:
</p>

<ul class="org-ul">
<li><code>areas/</code></li>
<li><code>projects/</code></li>
<li><code>personal/</code></li>
<li><code>pages/</code></li>
<li><code>assets/</code></li>
<li><code>public/</code></li>
</ul>

<p>
and set <code>noty-source-root</code>, <code>noty-publish-root</code> and
<code>noty-templates-dir</code> accordingly.
</p>

<p>
You can also set these variables manually via <code>M-x customize-group RET noty RET</code>.
</p>
</div>
</div>
<div id="outline-container-org5286b2e" class="outline-2">
<h2 id="org5286b2e"><span class="section-number-2">5.</span> Directory structure</h2>
<div class="outline-text-2" id="text-5">
<p>
A typical layout looks like:
</p>

<dl class="org-dl">
<dt><code>areas/</code></dt><dd>Long-lived themes and domains of knowledge.</dd>
<dt><code>projects/</code></dt><dd>Time-bounded projects.</dd>
<dt><code>personal/</code></dt><dd>Personal notes.</dd>
<dt><code>pages/</code></dt><dd>Miscellaneous pages such as this manual.</dd>
<dt><code>assets/css/</code></dt><dd>Stylesheets, including Modus theme CSS.</dd>
<dt><code>assets/js/</code></dt><dd>JavaScript files.</dd>
<dt><code>assets/templates/</code></dt><dd>HTML templates and partials.</dd>
<dt><code>assets/bib/</code></dt><dd>Bibliography files (global and local).</dd>
<dt><code>assets/tex/</code></dt><dd>Global TeX macro file (<code>customcommands.tex</code>).</dd>
<dt><code>public/</code></dt><dd>Generated static site (safe to host).</dd>
</dl>
</div>
</div>
<div id="outline-container-org53b603e" class="outline-2">
<h2 id="org53b603e"><span class="section-number-2">6.</span> Themes</h2>
<div class="outline-text-2" id="text-6">
<p>
emacs-noty ships with CSS themes inspired by Modus:
</p>

<dl class="org-dl">
<dt><code>modus-operandi</code></dt><dd>Light theme.</dd>
<dt><code>modus-operandi-tinted</code></dt><dd>Soft light variant.</dd>
<dt><code>modus-vivendi</code></dt><dd>Dark theme.</dd>
<dt><code>modus-vivendi-tinted</code></dt><dd>Soft dark variant.</dd>
</dl>

<p>
The global default is controlled by:
</p>

<ul class="org-ul">
<li><code>noty-default-theme</code></li>
</ul>

<p>
Per-page overrides are possible using a keyword:
</p>

<pre class="example" id="org36534e2">
#+THEME: modus-vivendi
</pre>

<p>
Templates receive the theme via the <code>/assets/css/modus-operandi.css</code> placeholder.
</p>
</div>
</div>
<div id="outline-container-org0f604ea" class="outline-2">
<h2 id="org0f604ea"><span class="section-number-2">7.</span> Layouts</h2>
<div class="outline-text-2" id="text-7">
<p>
Each page can choose a layout using:
</p>

<pre class="example" id="org63974e8">
#+LAYOUT: default
</pre>

<p>
or, for math-heavy pages:
</p>

<pre class="example" id="org3e9be86">
#+LAYOUT: maths
</pre>

<p>
For section index pages (like <code>areas/index.org</code>), you can use:
</p>

<pre class="example" id="org557d807">
#+LAYOUT: index
</pre>

<p>
which will add an automatically generated list of sibling notes
via the <code></code> placeholder.
</p>
</div>
</div>
<div id="outline-container-orgb435bb3" class="outline-2">
<h2 id="orgb435bb3"><span class="section-number-2">8.</span> Math engines</h2>
<div class="outline-text-2" id="text-8">
<p>
The math engine controls how LaTeX is rendered in HTML.  The
default is MathJax, which is expected to work out of the box.
</p>

<ul class="org-ul">
<li>Global default: <code>noty-default-math-engine</code> (a symbol).</li>
<li><p>
Per-page override:
</p>

<pre class="example" id="org816a2a3">
  #+MATH_ENGINE: mathjax
</pre>

<p>
or
</p>

<pre class="example" id="org5770b59">
  #+MATH_ENGINE: katex
</pre>

<p>
or
</p>

<pre class="example" id="org376c9c7">
  #+MATH_ENGINE: none
</pre></li>
</ul>

<p>
The chosen engine determines which math partial is injected into
the template via the <code><script src="/assets/js/mathjax-config.js"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js" id="MathJax-script"></script>
</code> placeholder.
</p>

<p>
Currently MathJax is the recommended and default choice.  KaTeX
is kept as an option for future use.
</p>
</div>
</div>
<div id="outline-container-org849148b" class="outline-2">
<h2 id="org849148b"><span class="section-number-2">9.</span> Global and local TeX macros</h2>
<div class="outline-text-2" id="text-9">
<p>
MathJax is configured via <code>assets/js/mathjax-config.js</code> and can
be extended using a global TeX file:
</p>

<ul class="org-ul">
<li><code>assets/tex/customcommands.tex</code></li>
</ul>

<p>
Additionally, pages can load extra macros locally using a
special block:
</p>

<pre class="example" id="org218b9ad">
#+ATTR_HTML: :class math_custom :data-macros "localmacros.tex"
#+begin_export html
&lt;!-- the JS will replace this with a display-math block --&gt;
#+end_export
</pre>

<p>
The bundled JavaScript will fetch the TeX file, parse
<code>\\newcommand</code>, <code>\\renewcommand</code> and <code>\\DeclareMathOperator</code>
forms, and register them as MathJax macros.
</p>
</div>
</div>
<div id="outline-container-org53b9cc8" class="outline-2">
<h2 id="org53b9cc8"><span class="section-number-2">10.</span> Bibliography</h2>
<div class="outline-text-2" id="text-10">
<p>
emacs-noty assumes a default bibliography file at:
</p>

<ul class="org-ul">
<li><code>assets/bib/library.bib</code></li>
</ul>

<p>
You can keep your main reference library there.  In addition, you
may place extra <code>.bib</code> files next to specific projects or areas
and configure Org's citation machinery (e.g. <code>org-cite</code>) to use
them alongside the global library.
</p>
</div>
</div>
<div id="outline-container-orgd9c9a6a" class="outline-2">
<h2 id="orgd9c9a6a"><span class="section-number-2">11.</span> Publishing</h2>
<div class="outline-text-2" id="text-11">
<p>
To set up the <code>org-publish</code> project, run:
</p>

<p>
Then you can publish:
</p>

<ul class="org-ul">
<li>The current file:</li>

<li>The entire site:</li>
</ul>

<p>
emacs-noty will:
</p>

<ol class="org-ol">
<li>Export the Org buffer to an HTML body using <code>ox-html</code>.</li>
<li>Collect metadata (title, layout, theme, math engine).</li>
<li>Generate a shadow index for section <code>index.org</code> files.</li>
<li>Load the chosen HTML template.</li>
<li>Replace placeholders like <code>{{title}}</code>, <code>{{content}}</code>,
<code><script src="/assets/js/mathjax-config.js"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js" id="MathJax-script"></script>
</code>, <code>/assets/css/modus-operandi.css</code>.</li>
<li>Write the final HTML to <code>noty-publish-root</code>, preserving the
relative directory structure.</li>
</ol>
</div>
</div>
<div id="outline-container-org2d25b29" class="outline-2">
<h2 id="org2d25b29"><span class="section-number-2">12.</span> Quick publish on save</h2>
<div class="outline-text-2" id="text-12">
<p>
To enable quick publishing for the current buffer, run:
</p>

<p>
This turns on <code>noty-quick-publish-mode</code>, which hooks into
<code>after-save-hook</code> and republishes the current file when it is
under <code>noty-source-root</code>.
</p>

<p>
To disable it:
</p>

<p>
You can control whether quick publish is globally allowed using
the variable <code>noty-quick-publish</code>.
</p>
</div>
</div>
<div id="outline-container-orge341ece" class="outline-2">
<h2 id="orge341ece"><span class="section-number-2">13.</span> Shadow indices</h2>
<div class="outline-text-2" id="text-13">
<p>
For each section, the <code>index.org</code> file can show a listing of all
other Org files in the same directory.  emacs-noty generates a
simple <code>&lt;ul&gt;</code> with links and injects it into the template via the
<code></code> placeholder.
</p>

<p>
The <code>index</code> layout wires this in by default.
</p>
</div>
</div>
<div id="outline-container-org80adf7a" class="outline-2">
<h2 id="org80adf7a"><span class="section-number-2">14.</span> Client-side features</h2>
<div class="outline-text-2" id="text-14">
<p>
The bundled JavaScript adds:
</p>

<ul class="org-ul">
<li>A per-page “On this page” sidebar using headings.</li>
<li>Automatic numbering and labelling of theorem-like blocks,
equations, figures and tables.</li>
<li>Relabelling of in-document links to those objects using the
generated labels.</li>
<li>A right-hand margin notes panel for elements with classes
<code>sidenote</code> or <code>marginnote</code>.</li>
<li>A theme toggle button (light/dark) with persistence in
<code>localStorage</code>.</li>
<li>Scroll position restoration across reloads, aware of MathJax
layout changes.</li>
<li>Global and local TeX macro loading as described above.</li>
</ul>
</div>
</div>
<div id="outline-container-org78cb3c9" class="outline-2">
<h2 id="org78cb3c9"><span class="section-number-2">15.</span> Previewing</h2>
<div class="outline-text-2" id="text-15">
<p>
If you set <code>noty-live-preview-url</code> to something like:
</p>

<p>
then after publishing, you can open the last page in a browser
using:
</p>

<p>
This simply concatenates the base URL with the site-relative
path of the last published page.
</p>
</div>
</div>
<div id="outline-container-org39a2d9f" class="outline-2">
<h2 id="org39a2d9f"><span class="section-number-2">16.</span> Development server</h2>
<div class="outline-text-2" id="text-16">
<p>
The skeleton includes a small helper script under <code>scripts/</code>:
</p>

<ul class="org-ul">
<li><code>scripts/dev-watch</code></li>
</ul>

<p>
which uses <code>browser-sync</code> to serve the <code>public/</code> directory and
reload on changes.
</p>
</div>
</div>
<div id="outline-container-orgd97bd8b" class="outline-2">
<h2 id="orgd97bd8b"><span class="section-number-2">17.</span> Conclusion</h2>
<div class="outline-text-2" id="text-17">
<p>
emacs-noty gives you a flexible, template-driven publishing
pipeline for Org-mode notes, with clean separation between
content, presentation, and output.  You can customise layouts,
themes, and math rendering without changing your note files.
</p>

<p>
Happy writing!
</p>
</div>
</div>

      
    </article>
    <!-- notes-panel is created dynamically if missing -->
  </main>
  <footer class="noty-footer">
    <div class="noty-footer-inner">
  <p>Generated with <code>emacs-noty</code>.</p>
</div>

  </footer>
  <script src="/assets/js/theme.js"></script>
  <script src="/assets/js/site.js"></script>
  <script src="/assets/js/refs.js"></script>
  <script src="/assets/js/scroll-restore.js"></script>
  <script src="/assets/js/load-math-macros.js"></script>
  <script src="/assets/js/link-preview.js"></script>
  <script src="/assets/js/mathjax-config.js"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js" id="MathJax-script"></script>

</body>
</html>
